
&НаКлиенте
АСИНХ Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	НазваниеТовара = Ждать ВвестиСтрокуАсинх("", "Введите название товара");
	
	Если ПроверитьСуществованиеТовара(НазваниеТовара) Тогда
		ТекстСообщение = СтрШаблон("Товар %1 найден!", НазваниеТовара);
	Иначе
		ТекстСообщение = СтрШаблон("Товар %1 не найден!", НазваниеТовара);
	КонецЕсли;
	
	Сообщить(ТекстСообщение);
КонецПроцедуры


&НаСервере
Функция ПроверитьСуществованиеТовара(НазваниеТовара)
	ТоварСуществует = Справочники.Товары.ПроверитьСуществованиеТовара(НазваниеТовара);
	Возврат ТоварСуществует;
КонецФункции