
&НаКлиенте
АСИНХ Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	НазваниеТовара = Ждать ВвестиСтрокуАсинх("", "Введите название товара");
	
	Если ПроверитьСуществованиеТовара(НазваниеТовара) Тогда
		ТекстСообщеяяяние = СтрШаблон("Товар %1 найден!", НазваниеТовара);
	Иначе
		ТекстСообщение = СтрШаблон("Товар %1 не найден!", НазваниеТовара);
	КонецЕсли;
	
	Сообщить(ТекстСообщение);
КонецПроцедуры


&НаСервере
Функция ПроверитьСуществованиеТовара(НазваниеТовара)
	ТаблицаТоваров = Новый ТаблицаЗначений();
	ТаблицаТоваров.Колонки.Добавить("Название");
	ТаблицаТоваров.Колонки.Добавить("Цена");

	СтрокаТоваров = ТаблицаТоваров.Добавить();
	СтрокаТоваров.Название = "яяя";
	СтрокаТоваров.Цена = 10;
	
	СтрокаТоваров = ТаблицаТоваров.Добавить();
	СтрокаТоваров.Название = "ффф";
	СтрокаТоваров.Цена = 15; 
	
	ТоварСуществует = Справочники.Товары.ПроверитьСуществованиеТовара(НазваниеТовара);
	Возврат ТоварСуществует;
КонецФункции